---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SymbolIdParam
source: html/eaedf5e7-40b6-8986-5dca-945e01d118cb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SymbolIdParam Property

"Type Id"

## Syntax (C#)
```csharp
public static ForgeTypeId SymbolIdParam { get; }
```